; domain
(define (domain miconic)
  (:requirements :typing :conditional-effects :negative-preconditions)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop

(:action stop
  :parameters (?f - floor)
  :precondition (lift-at ?f)
  :effect (and 
               (forall (?p - passenger) 
                  (when (and (boarded ?p) 
                             (destin ?p ?f))
                        (and (not (boarded ?p)) 
                             (served  ?p))))
               (forall (?p - passenger)                
                   (when (and (origin ?p ?f) (not (served ?p)))
                              (boarded ?p)))))


;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f6-p3-u0-v0-g0-a0-n0-A0-B0-N0-F0-r0)
   (:domain miconic)
   (:objects p0 p1 p2 - passenger
             f0 f1 f2 f3 f4 f5 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)

(above f2 f3)
(above f2 f4)
(above f2 f5)

(above f3 f4)
(above f3 f5)

(above f4 f5)



(origin p0 f1)
(destin p0 f4)

(origin p1 f3)
(destin p1 f1)

(origin p2 f5)
(destin p2 f1)






(lift-at f0)
)


(:goal (and 
(served p0)
(served p1)
(served p2)
))
)

; plan
1. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 3
2. (up f1 f3)
   deleted: (lift-at f1)
   added: (lift-at f3)
   goals met: 0 of 3
3. (stop f3)
   added: (boarded p1)
   goals met: 0 of 3
4. (down f3 f1)
   deleted: (lift-at f3)
   added: (lift-at f1)
   goals met: 0 of 3
5. (stop f1)
   deleted: (boarded p1)
   added: (served p1) (boarded p0)
   goals met: 1 of 3
6. (up f1 f4)
   deleted: (lift-at f1)
   added: (lift-at f4)
   goals met: 1 of 3
7. (stop f4)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 2 of 3
8. (down f4 f1)
   deleted: (lift-at f4)
   added: (lift-at f1)
   goals met: 2 of 3
9. (up f1 f5)
   deleted: (lift-at f1)
   added: (lift-at f5)
   goals met: 2 of 3
10. (stop f5)
   added: (boarded p2)
   goals met: 2 of 3
11. (down f5 f1)
   deleted: (lift-at f5)
   added: (lift-at f1)
   goals met: 2 of 3
12. (stop f1)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 3
